# Function Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructureLayer..::..Function Property
CompoundStructureLayer Class See Also
---
The function of the layer.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public MaterialFunctionAssignment Function { get; set; }
```

Visual Basic
---
```text
Public Property Function As MaterialFunctionAssignment
	Get
	Set
```

Visual C++
---
```text
public:
property MaterialFunctionAssignment Function {
	MaterialFunctionAssignment get ();
	void set (MaterialFunctionAssignment value);
}
```

# ### Field Value
The default is MaterialFunctionAssignment.None.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
CompoundStructureLayer Class
Autodesk.Revit.DB Namespace